%%%------------------------------------------------	
%%% File    : tpl_skill.erl	
%%% Author  : table_to_erlang	
%%% Created : 
%%% Description:从数据库表temp_skill生成
%%% WARNING:程序生成，请不要增加手工代码！
%%%------------------------------------------------    	
 	
-module(tpl_skill). 	
-compile(export_all). 	
	
get(1)->
	{temp_skill, 1, <<"战士普通攻击">>, 0, 0, 1, 1, 1, 0, 0, 700, [],0, 0, <<"描述待添加">>, 0};	
get(2)->
	{temp_skill, 2, <<"法师普通攻击">>, 0, 0, 1, 2, 2, 0, 0, 700, [],0, 0, <<"描述待添加">>, 0};	
get(3)->
	{temp_skill, 3, <<"射手普通攻击">>, 0, 0, 1, 3, 2, 0, 0, 700, [],0, 0, <<"描述待添加">>, 0};	
get(5)->
	{temp_skill, 5, <<"小怪普通攻击">>, 0, 0, 2, 0, 1, 0, 0, 800, [],0, 0, <<"描述待添加">>, 0};	
get(11)->
	{temp_skill, 11, <<"飞剑术">>, 0, 1, 1, 1, 1, 0, 0, 700, [],0, 0, <<"描述待添加">>, 0};	
get(12)->
	{temp_skill, 12, <<"如封似闭">>, 0, 1, 1, 1, 1, 0, 0, 700, [],0, 0, <<"描述待添加">>, 1};	
get(13)->
	{temp_skill, 13, <<"群魔乱舞">>, 0, 2, 1, 1, 0, 3, 10, 700, [],0, 0, <<"描述待添加">>, 0};	
get(14)->
	{temp_skill, 14, <<"圣光普照">>, 0, 4, 1, 1, 0, 3, 5, 700, [],0, 0, <<"描述待添加">>, 0};	
get(15)->
	{temp_skill, 15, <<"万剑归一">>, 0, 2, 1, 1, 0, 3, 10, 700, [],0, 0, <<"描述待添加">>, 0};	
get(21)->
	{temp_skill, 21, <<"破空击">>, 0, 1, 1, 2, 2, 0, 0, 700, [],0, 0, <<"描述待添加">>, 0};	
get(22)->
	{temp_skill, 22, <<"幽冥鬼爪">>, 0, 1, 1, 2, 2, 0, 0, 700, [],0, 0, <<"描述待添加">>, 1};	
get(23)->
	{temp_skill, 23, <<"九阴玄雷">>, 0, 2, 1, 2, 0, 3, 10, 700, [],0, 0, <<"描述待添加">>, 0};	
get(24)->
	{temp_skill, 24, <<"无法无相">>, 0, 4, 1, 2, 0, 3, 5, 700, [],0, 0, <<"描述待添加">>, 0};	
get(25)->
	{temp_skill, 25, <<"雷动九天">>, 0, 2, 1, 2, 0, 3, 10, 700, [],0, 0, <<"描述待添加">>, 0};	
get(31)->
	{temp_skill, 31, <<"凝霜箭">>, 0, 1, 1, 3, 2, 0, 0, 700, [],0, 0, <<"描述待添加">>, 0};	
get(32)->
	{temp_skill, 32, <<"寒冰击">>, 0, 1, 1, 3, 2, 0, 0, 700, [],0, 0, <<"描述待添加">>, 1};	
get(33)->
	{temp_skill, 33, <<"箭雨流星">>, 0, 2, 1, 3, 0, 3, 10, 700, [],0, 0, <<"描述待添加">>, 0};	
get(34)->
	{temp_skill, 34, <<"孤注一掷">>, 0, 4, 1, 3, 0, 3, 5, 700, [],0, 0, <<"描述待添加">>, 0};	
get(35)->
	{temp_skill, 35, <<"万蛊噬心">>, 0, 2, 1, 3, 0, 3, 10, 700, [],0, 0, <<"描述待添加">>, 0};	
get(_)->	
	[].	
