%%%------------------------------------------------	
%%% File    : tpl_task.erl	
%%% Author  : table_to_erlang	
%%% Created : 
%%% Description:从数据库表temp_task生成
%%% WARNING:程序生成，请不要增加手工代码！
%%%------------------------------------------------    	
 	
-module(tpl_task). 	
-compile(export_all). 	
	
get(1)->
	{tpl_task, 1, 0, 10001, 100, 10001, 100, 1, [{1,10,0}],<<"转世为人">>, <<"去（新手村）找（接引仙子）">>, [{"XXX，你的元灵在仙界游荡万年，今日终于由九龙接引，降临转生台转世成人。"}],[{"如今仙魔大战在所难免，仙界众生等待着你的鼎力相助，快去神兵守卫处接领你的武器吧！"}],-1, 0, 0, 0, 0, 0, 0, 0, [{0,0,1,2},{0,0,2,6},{1,2,1,3}],[],0, -1};	
get(2)->
	{tpl_task, 2, 0, 10002, 100, 10002, 100, 1, [{2,8,0}],<<"神兵在手">>, <<"去（新手村）得（新手武器）">>, [{"我在此守卫这把神兵万年，只等待仙君转世，解除封印!"}],[{"前世的神兵，如今又终于回到你的手中！"},{"拿着这把武器，我有一种很熟悉的感觉…"}],-1, 0, 0, 0, 0, 0, 0, 0, [{0,0,1,2},{0,0,2,6},{1,2,1,3}],[],0, -1};	
get(_)->	
	[].	
	
get_by_type(0)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[1],[2]]);	
	
get_by_type(_)->	
 [].	
	
get_by_type_level(0,0)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[1],[2]]);	
	
get_by_type_level(_,_)->	
 [].	
