%%%------------------------------------------------	
%%% File    : tpl_drop_sub.erl	
%%% Author  : table_to_erlang	
%%% Created : 
%%% Description:从数据库表temp_drop_sub生成
%%% WARNING:程序生成，请不要增加手工代码！
%%%------------------------------------------------    	
 	
-module(tpl_drop_sub). 	
-compile(export_all). 	
	
get(1001)->
	{temp_drop_sub, 1001, [{541004201,400,10000}]};	
get(1002)->
	{temp_drop_sub, 1002, [{531004201,100,10000}]};	
get(1003)->
	{temp_drop_sub, 1003, [{541004201,400,10000}]};	
get(1004)->
	{temp_drop_sub, 1004, [{531004201,120,10000}]};	
get(1005)->
	{temp_drop_sub, 1005, [{541004201,400,10000}]};	
get(1006)->
	{temp_drop_sub, 1006, [{531004201,140,10000}]};	
get(1007)->
	{temp_drop_sub, 1007, [{541004201,400,10000}]};	
get(1008)->
	{temp_drop_sub, 1008, [{531004201,160,10000}]};	
get(1101)->
	{temp_drop_sub, 1101, [{463004201,1,10000}]};	
get(1102)->
	{temp_drop_sub, 1102, [{211031204,1,8000},{211032204,1,1500},{211033204,1,500}]};	
get(_)->	
	[].	
